# SetCellType Method (Int32, CellType) (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
TableSectionData..::..SetCellType Method (Int32, CellType)
TableSectionData Class See Also
---
Sets a column's cell type
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public void SetCellType(
	int nCol,
	CellType type
)
```

Visual Basic
---
```text
Public Sub SetCellType ( _
	nCol As Integer, _
	type As CellType _
)
```

Visual C++
---
```text
public:
void SetCellType(
	int nCol,
	CellType type
)
```

# ### Parameters
nCol
    Type: System..::..Int32
type
    Type: Autodesk.Revit.DB..::..CellType
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The given column number nCol is invalid. |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This operation is forbidden for cells in standard schedule body sections. |

# See Also
TableSectionData Class
SetCellType Overload
Autodesk.Revit.DB Namespace